'''
2단부터 9단까지 구구단을 출력하되
짝수단은 역순 홀수단은 정순으로 출력하세요

짝수단은 : 2x9=18, 2x8=16, ...
홀수단은 : 3x1=3, 3x2=6
'''
for i in range(1, 10, 1):
    print("---------------------------------------------------- {} 단 출력 ----------------------------------------------------".format(i))
    if i % 2 == 0:
        for j in range(9, 0, -1):
            print("{} * {} = {}" .format(i, j, i*j) ,end='   ')
    else :
        for j in range(1, 10, 1):
            print("{} * {} = {}" .format(i, j, i*j), end='   ')
    print()
